
public class Test2{
	public static  void main(String agrs[]){
		/**
			计算机底层存储的数据：底层存储都是0101的二进制数字（整数）
			计算机的数据：文本，声音，图片，视频...怎么存储的-》都是进行【编码】为【整数】再进行存储的。
			
			文本->是怎么编码为【整数的】-》通过【字符集】
			
			字符集：存储了很多【字符（文字）】和【整数】对应的关系。
			
			常见字符集：ascii，utf-8，gbk，unicode（utf-16）
			注意点
			1）不同字符集的字符个数和字符整数对应关系不一致
			2）ascii所有字符集的老大-定义（字母，数字，常用符号）其他字符集都是从ascii扩展而来。
			
			
			字符编码（存储字符的过程）：把【字符】转换为【指定字符集】的【整数】的过程
			字符解码（显示字符的过程）：把【整数】转换为【指定字符集】的【字符】的过程
			
			
			window中文系统新建文本文件-默认是gbk编码
			ansi-》代表的就是gbk
			
			注意点：
			字符存储的编码和显示的解码采用的字符集必须一致-否则可能出现乱码问题
			
		*/
	}
}